cask_args appdir: '/Applications'

brew 'asdf'
brew 'bash'
brew 'gnu-sed'
brew 'vim'
brew 'coreutils'
brew 'findutils'
brew 'ack'
brew 'jq'
brew 'direnv'
brew 'tree'
brew 'carlocab/personal/unrar'
brew 'gpg'
brew 'git-lfs'
brew 'imagemagick'
brew 'openssl'
brew 'thefuck'
brew 'michaeldfallen/formula/git-radar'
brew 'podman'
brew 'podman-compose'

cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
