cask_args appdir: '/Applications'

tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'
tap 'caskroom/versions'
tap 'michaeldfallen/formula'

brew 'fish'
brew 'bash'
brew 'homebrew/versions/bash-completion2'
brew 'gnu-sed', args: ['with-default-names']
brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/apple-gcc42'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'coreutils'
brew 'findutils'
brew 'ack'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'git'
brew 'git-lfs'
brew 'gibo'
brew 'imagemagick', args: ['with-webp']
brew 'lynx'
brew 'lcov'
brew 'openssl'
brew 'testssl'
brew 'thefuck'
brew 'michaeldfallen/formula/git-radar'
brew 'cocoapods'
# https://github.com/crsmithdev/goenv
brew 'goenv'
brew 'jenv'
brew 'mysql'
# https://github.com/creationix/nvm
brew 'nvm'
brew 'phantomjs'
brew 'php-version'
brew 'php56', args: ['with-gmp']
# https://github.com/yyuu/pyenv
brew 'pyenv'
# https://github.com/rbenv/rbenv
brew 'rbenv'
brew 'ruby-build'
brew 'sqlite'

cask 'docker'
cask 'vlc'
cask 'google-chrome'
cask 'transmission'
cask 'transmit'
cask 'mou'
cask 'dash'
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'android-studio'
cask 'pycharm-ce'
cask 'sequel-pro'
